import pandas as pd
import pytest


@pytest.fixture
def operations_list_of_dict() -> list:
    """Список операций в виде списка"""

    operations_list = [
        {
            "Дата операции": "02.12.2021 21:44:30",
            "Дата платежа": "03.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -10.33,
            "Валюта операции": "RUB",
            "Сумма платежа": -10.33,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 10.33,
        },
        {
            "Дата операции": "02.12.2021 21:10:00",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -125.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -125.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 6,
            "Категория": "Фастфуд",
            "MCC": 5814,
            "Описание": "ЦЕХ 85",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 125.0,
        },
        {
            "Дата операции": "02.12.2021 16:26:02",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -5510.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -5510.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 25,
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 275,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 5510.8,
        },
        {
            "Дата операции": "02.12.2021 15:18:26",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -496.51,
            "Валюта операции": "RUB",
            "Сумма платежа": -496.51,
            "Валюта платежа": "RUB",
            "Кэшбэк": 3,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 9,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 496.51,
        },
        {
            "Дата операции": "02.12.2021 14:41:17",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -15.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -15.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Связь",
            "MCC": 7379,
            "Описание": "Devajs Servis.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 15.0,
        },
        {
            "Дата операции": "01.12.2021 23:40:34",
            "Дата платежа": "02.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -1.07,
            "Валюта операции": "RUB",
            "Сумма платежа": -1.07,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Каршеринг",
            "MCC": 7512,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1.07,
        },
        {
            "Дата операции": "01.12.2021 18:50:24",
            "Дата платежа": "01.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -99.22,
            "Валюта операции": "RUB",
            "Сумма платежа": -99.22,
            "Валюта платежа": "RUB",
            "Кэшбэк": 5,
            "Категория": "Супермаркеты",
            "MCC": 5411,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 99.22,
        },
        {
            "Дата операции": "01.12.2021 13:12:18",
            "Дата платежа": "01.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -199.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -199.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1,
            "Категория": "Дом и ремонт",
            "MCC": 5211,
            "Описание": "Строитель",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 199.0,
        },
        {
            "Дата операции": "01.12.2021 12:35:05",
            "Дата платежа": "01.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -99.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -99.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Фастфуд",
            "MCC": 5814,
            "Описание": "IP Yakubovskaya M.V.",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 99.0,
        },
    ]
    return operations_list


@pytest.fixture
def operations(operations_list_of_dict: list[dict]) -> pd.DataFrame:
    """Список операций в виде DataFrame"""

    operations_df = pd.DataFrame.from_dict(operations_list_of_dict)
    return operations_df


@pytest.fixture
def top_5_operations_until_2021_12_03() -> list:
    """Список топ 5 операций по платежам до 2021-12-03 00:00:00"""

    operations = [
        {"date": "02.12.2021", "amount": -125.0, "category": "Фастфуд", "description": "ЦЕХ 85"},
        {"date": "02.12.2021", "amount": -5510.8, "category": "Каршеринг", "description": "Ситидрайв"},
        {"date": "02.12.2021", "amount": -496.51, "category": "Супермаркеты", "description": "Магнит"},
        {"date": "01.12.2021", "amount": -99.22, "category": "Супермаркеты", "description": "Дикси"},
        {"date": "01.12.2021", "amount": -199.0, "category": "Дом и ремонт", "description": "Строитель"},
    ]
    return operations


@pytest.fixture
def top_5_operations_until_2021_12_02() -> list:
    """Список топ 5 операций по платежам до 2021-12-02 00:00:00"""

    operations = [
        {"date": "01.12.2021", "amount": -1.07, "category": "Каршеринг", "description": "Ситидрайв"},
        {"date": "01.12.2021", "amount": -99.22, "category": "Супермаркеты", "description": "Дикси"},
        {"date": "01.12.2021", "amount": -199.0, "category": "Дом и ремонт", "description": "Строитель"},
        {"date": "01.12.2021", "amount": -99.0, "category": "Фастфуд", "description": "IP Yakubovskaya M.V."},
    ]
    return operations


@pytest.fixture
def user_settings() -> str:
    """Словарь данных пользователя"""

    user_data = '{"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}'
    return user_data


@pytest.fixture
def some_currency_rates() -> str:
    """Стоимость валют"""

    currency_rates = {
        "Date": "2025-10-25T11:30:00+03:00",
        "PreviousDate": "2025-10-24T11:30:00+03:00",
        "PreviousURL": "daily_json.js",
        "Timestamp": "2025-10-24T20:00:00+03:00",
        "Valute": {
            "USD": {
                "ID": "R01235",
                "NumCode": "840",
                "CharCode": "USD",
                "Nominal": 1,
                "Name": "Доллар США",
                "Value": 80.9713,
                "Previous": 81.269,
            },
            "EUR": {
                "ID": "R01239",
                "NumCode": "978",
                "CharCode": "EUR",
                "Nominal": 1,
                "Name": "Евро",
                "Value": 94.082,
                "Previous": 94.3889,
            },
        },
    }

    return currency_rates


@pytest.fixture
def stock() -> dict:
    """Информация по некоторым акциям"""

    stock = {
        "Global Quote": {
            "01. symbol": "AAPL",
            "02. open": "259.9400",
            "03. high": "260.6200",
            "04. low": "258.0101",
            "05. price": "259.5800",
            "06. volume": "32754941",
            "07. latest trading day": "2025-10-23",
            "08. previous close": "258.4500",
            "09. change": "1.1300",
            "10. change percent": "0.4372%",
        }
    }
    return stock


@pytest.fixture
def stock_price() -> list:
    """Стоимость некоторых акций"""

    stock_price = [{"stock": "AAPL", "price": "259.5800"}]
    return stock_price
