import pandas as pd
import pytest


@pytest.fixture
def operations() -> pd.DataFrame:
    """Список операций"""

    operations_dict = {
        "Дата операции": {
            0: "02.12.2021 21:44:30",
            1: "02.12.2021 21:10:00",
            2: "02.12.2021 16:26:02",
            3: "02.12.2021 15:18:26",
            4: "02.12.2021 14:41:17",
            5: "01.12.2021 23:40:34",
            6: "01.12.2021 18:50:24",
            7: "01.12.2021 13:12:18",
            8: "01.12.2021 12:35:05",
        },
        "Дата платежа": {
            0: "03.12.2021",
            1: "02.12.2021",
            2: "02.12.2021",
            3: "02.12.2021",
            4: "02.12.2021",
            5: "02.12.2021",
            6: "01.12.2021",
            7: "01.12.2021",
            8: "01.12.2021",
        },
        "Номер карты": {
            0: "*5091",
            1: "*7197",
            2: "*5091",
            3: "*7197",
            4: "*7197",
            5: "*5091",
            6: "*7197",
            7: "*7197",
            8: "*7197",
        },
        "Статус": {0: "OK", 1: "OK", 2: "OK", 3: "OK", 4: "OK", 5: "OK", 6: "OK", 7: "OK", 8: "OK"},
        "Сумма операции": {
            0: -10.33,
            1: -125.0,
            2: -5510.8,
            3: -496.51,
            4: -15.0,
            5: -1.07,
            6: -99.22,
            7: -199.0,
            8: -99.0,
        },
        "Валюта операции": {0: "RUB", 1: "RUB", 2: "RUB", 3: "RUB", 4: "RUB", 5: "RUB", 6: "RUB", 7: "RUB", 8: "RUB"},
        "Сумма платежа": {
            0: -10.33,
            1: -125.0,
            2: -5510.8,
            3: -496.51,
            4: -15.0,
            5: -1.07,
            6: -99.22,
            7: -199.0,
            8: -99.0,
        },
        "Валюта платежа": {0: "RUB", 1: "RUB", 2: "RUB", 3: "RUB", 4: "RUB", 5: "RUB", 6: "RUB", 7: "RUB", 8: "RUB"},
        "Кэшбэк": {0: "", 1: 6, 2: 25, 3: 3, 4: "", 5: "", 6: 5, 7: 1, 8: ""},
        "Категория": {
            0: "Каршеринг",
            1: "Фастфуд",
            2: "Каршеринг",
            3: "Супермаркеты",
            4: "Связь",
            5: "Каршеринг",
            6: "Супермаркеты",
            7: "Дом и ремонт",
            8: "Фастфуд",
        },
        "MCC": {0: 7512, 1: 5814, 2: 7512, 3: 5411, 4: 7379, 5: 7512, 6: 5411, 7: 5211, 8: 5814},
        "Описание": {
            0: "Ситидрайв",
            1: "ЦЕХ 85",
            2: "Ситидрайв",
            3: "Магнит",
            4: "Devajs Servis.",
            5: "Ситидрайв",
            6: "Дикси",
            7: "Строитель",
            8: "IP Yakubovskaya M.V.",
        },
        "Бонусы (включая кэшбэк)": {0: 0, 1: 2, 2: 275, 3: 9, 4: 0, 5: 0, 6: 1, 7: 3, 8: 1},
        "Округление на инвесткопилку": {0: 0, 1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0, 8: 0},
        "Сумма операции с округлением": {
            0: 10.33,
            1: 125.0,
            2: 5510.8,
            3: 496.51,
            4: 15.0,
            5: 1.07,
            6: 99.22,
            7: 199.0,
            8: 99.0,
        },
    }

    operations_df = pd.DataFrame.from_dict(operations_dict)
    return operations_df


@pytest.fixture
def top_5_operations_until_2021_12_03() -> list:
    """Список топ 5 операций по платежам до 2021-12-03 00:00:00"""

    operations = [
        {"date": "02.12.2021", "amount": -125.0, "category": "Фастфуд", "description": "ЦЕХ 85"},
        {"date": "02.12.2021", "amount": -5510.8, "category": "Каршеринг", "description": "Ситидрайв"},
        {"date": "02.12.2021", "amount": -496.51, "category": "Супермаркеты", "description": "Магнит"},
        {"date": "01.12.2021", "amount": -99.22, "category": "Супермаркеты", "description": "Дикси"},
        {"date": "01.12.2021", "amount": -199.0, "category": "Дом и ремонт", "description": "Строитель"},
    ]
    return operations


@pytest.fixture
def top_5_operations_until_2021_12_02() -> list:
    """Список топ 5 операций по платежам до 2021-12-02 00:00:00"""

    operations = [
        {"date": "01.12.2021", "amount": -1.07, "category": "Каршеринг", "description": "Ситидрайв"},
        {"date": "01.12.2021", "amount": -99.22, "category": "Супермаркеты", "description": "Дикси"},
        {"date": "01.12.2021", "amount": -199.0, "category": "Дом и ремонт", "description": "Строитель"},
        {"date": "01.12.2021", "amount": -99.0, "category": "Фастфуд", "description": "IP Yakubovskaya M.V."},
    ]
    return operations


@pytest.fixture
def user_settings() -> str:
    """Словарь данных пользователя"""

    user_data = '{"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}'
    return user_data


@pytest.fixture
def some_currency_rates() -> str:
    """Стоимость валют"""

    currency_rates = {
        "Date": "2025-10-25T11:30:00+03:00",
        "PreviousDate": "2025-10-24T11:30:00+03:00",
        "PreviousURL": "daily_json.js",
        "Timestamp": "2025-10-24T20:00:00+03:00",
        "Valute": {
            "USD": {
                "ID": "R01235",
                "NumCode": "840",
                "CharCode": "USD",
                "Nominal": 1,
                "Name": "Доллар США",
                "Value": 80.9713,
                "Previous": 81.269,
            },
            "EUR": {
                "ID": "R01239",
                "NumCode": "978",
                "CharCode": "EUR",
                "Nominal": 1,
                "Name": "Евро",
                "Value": 94.082,
                "Previous": 94.3889,
            },
        },
    }

    return currency_rates


@pytest.fixture
def stock() -> dict:
    """Информация по некоторым акциям"""

    stock = {
        "Global Quote": {
            "01. symbol": "AAPL",
            "02. open": "259.9400",
            "03. high": "260.6200",
            "04. low": "258.0101",
            "05. price": "259.5800",
            "06. volume": "32754941",
            "07. latest trading day": "2025-10-23",
            "08. previous close": "258.4500",
            "09. change": "1.1300",
            "10. change percent": "0.4372%",
        }
    }
    return stock


@pytest.fixture
def stock_price() -> list:
    """Стоимость некоторых акций"""

    stock_price = [{"stock": "AAPL", "price": "259.5800"}]
    return stock_price
